# FieldBuilder Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldBuilder Methods
FieldBuilder Class See Also
---
The FieldBuilder type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| NeedsSubSchemaGUID | Checks whether the SubSchema GUID needs to be explicitly specified for this field type. |
| NeedsUnits | Checks whether the field type requires explicit unit conversions. |
| Ready | Checks whether the builder may be used. |
| SetDocumentation | Sets the documentation string for the Field. |
| SetSpec | Sets the spec describing the field's values. |
| SetSubSchemaGUID | Sets the GUID of the Schema of the Entities that are intended to be stored in this field. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace